In [3]:
import pandas as pd
import numpy as np
names=['a','b','c','d','message']
df=pd.read_csv('example2.csv',names=names,index_col='message')
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [8]:
#in csv_mindex.csv we got 
#key1,key2,value1,value2 
#one,a,1,2 
#one,b,3,4 
#one,c,5,6 
#one,d,7,8 
#two,a,9,10 
#two,b,11,12 
#two,c,13,14 
#two,d,15,16
parsed=pd.read_csv('csv_mindex.csv',index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [10]:
list(open('ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [13]:
result=pd.read_table('ex3.txt',sep='\s+')
#use spaces(one or more) as delimiter 
result

C:\Users\kumail\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [19]:
#ex4 have:
## hey!                      //commented
#a,b,c,d,message
## just wanted to make things more difficult for you  //commented 
## who reads CSV files with computers, anyway?    //commented
#1,2,3,4,hello 
#5,6,7,8,world 
#9,10,11,12,foo

pd.read_csv('ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Handling missing values is an important and frequently nuanced part of the file parsing process. Missing data is usually either not present (empty string) or marked by some sentinel value. By default, pandas uses a set of commonly occurring sentinels, such as NA and NULL:

In [22]:
#in our file ex5 we got
#something,a,b,c,d,message
#one,1,2,3,4,NA 
#two,5,6,,8,world 
#three,9,10,11,12,foo


result = pd.read_csv('ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [23]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [26]:
result = pd.read_csv('ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [29]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

# Reading Text Files in Pieces

In [30]:
#we got 10000 rows data in ex6
pd.read_csv('ex6.csv',nrows=10)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

In [3]:
import pandas as pd
chunks=pd.read_csv('ex6.csv',chunksize=200)
#print(type(chunks),print(chunks))

chunkList=[]
for chunk in chunks:
    #print(type(chunk),len(chunk))
    #print(chunk.head()) #head() shows five rows of n rowns
    chunkList.append(chunk)
chunkList[0].head()

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [42]:
t=pd.read_csv('ex6.csv',nrows=7) #shows n rows
t

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U

In [44]:
chunker = pd.read_csv('ex6.csv', chunksize=1000)
tot = pd.Series([]) 
for piece in chunker:    
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [45]:
#Table 6-2. Some read_csv/read_table function arguments

# Writing data to text file

In [58]:
data=pd.read_csv('ex5.csv')
print(data)
#Using DataFrame’s to_csv method, we can write the data out to a comma-separated file:
#
data.to_csv('out.csv')# to output in file

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [59]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [63]:
#Other delimiters can be used, of course (writing to sys.stdout so it prints the text result to the console):

import sys
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [61]:
#Missing values appear as empty strings in the output. You might want to denote them by some other sentinel value
data.to_csv(sys.stdout, na_rep='NULL') #

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [62]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [52]:
import numpy as np
dates=pd.date_range('1/1/2000',periods=7)
ts=pd.Series(np.arange(7), index=dates)
ts
ts.to_csv('output.csv')

C:\Users\kumail\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """

# Working with delimiter format

In [1]:
import csv
f=open('ex7.csv')
reader=csv.reader(f)
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

It’s possible to load most forms of tabular data from disk using functions like pan das.read_table. In some cases, however, some manual processing may be necessary. It’s not uncommon to receive a file with one or more malformed lines that trip up read_table

In [3]:
import pandas as pd
pd.read_csv('ex7.csv')

   a  b  c
0  1  2  3
1  1  2  3

In [5]:
with open('ex7.csv') as f:
    lines=list(csv.reader(f))
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [6]:
header,values=lines[0],lines[1:]

In [7]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [8]:
header

['a', 'b', 'c']

In [9]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)   
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))    
    writer.writerow(('4', '5', '6'))    
    writer.writerow(('7', '8', '9'))

NameError: name 'my_dialect' is not defined

# JSON Data

In [13]:
import json
#json format
obj = """  
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
#print(obj)
# same like dictionary
data = pd.read_json('example.json')#The pandas.read_json can automatically convert JSON datasets in specific arrangements into a Series or DataFrame. For example
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [15]:
result=json.loads(obj) #json. loads() takes in a string and returns a json object. json. dumps() takes in a json object and returns a string.
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [18]:
asjson=json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [21]:
siblings=pd.DataFrame(result['siblings'],columns=['name','age'])
siblings

    name  age
0  Scott   30
1  Katie   38

# WEB SCRAPPING

In [24]:
tables = pd.read_html('fdic_failed_bank_list.html')
len(tables)

1

In [28]:
failuresdf=tables[0] #0 because we want first tabular data
failuresdf.shape # tells rows and columns present

(547, 7)

In [33]:
print(type(failuresdf))
print()
print(type(tables))

<class 'pandas.core.frame.DataFrame'>

<class 'list'>

In [29]:
failuresdf['Bank Name'].head()

0                     Allied Bank
1    The Woodbury Banking Company
2          First CornerStone Bank
3              Trust Company Bank
4      North Milwaukee State Bank
Name: Bank Name, dtype: object

In [30]:
failuresdf['City'].head()

0           Mulberry
1           Woodbury
2    King of Prussia
3            Memphis
4          Milwaukee
Name: City, dtype: object

In [31]:
failuresdf.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [35]:
# for large and complicated dataframe, try to extract
# data as series for review and analysis
# here we converted a column into a new series of date type
close_timestamps = pd.to_datetime(failuresdf['Closing Date']) #we converted it to datetime format so it would be easier afterwards
print(type(close_timestamps),close_timestamps)

<class 'pandas.core.series.Series'> 0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
5     2015-10-02
6     2015-10-02
7     2015-07-10
8     2015-05-08
9     2015-02-27
10    2015-02-13
11    2015-01-23
12    2015-01-16
13    2014-12-19
14    2014-11-07
15    2014-10-24
16    2014-10-17
17    2014-07-25
18    2014-07-18
19    2014-06-27
20    2014-06-20
21    2014-06-20
22    2014-05-30
23    2014-05-23
24    2014-05-16
25    2014-04-25
26    2014-02-28
27    2014-02-28
28    2014-01-31
29    2014-01-24
         ...
517   2008-05-09
518   2008-03-07
519   2008-01-25
520   2007-10-04
521   2007-09-28
522   2007-02-02
523   2004-06-25
524   2004-03-19
525   2004-03-12
526   2004-02-14
527   2003-11-14
528   2003-05-09
529   2003-02-07
530   2002-12-17
531   2002-11-08
532   2002-09-30
533   2002-06-27
534   2002-06-26
535   2002-03-28
536   2002-03-01
537   2002-02-07
538   2002-02-01
539   2002-01-18
540   2002-01-11
541   2001-09-07
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [40]:
 close_timestamps.dt.year.value_counts()  #individual indexes frequencies of(month,year,day) can be found

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

# Binary Data Format

In [42]:
#reason to use :
#takes less place 
# so takes less time to save and load as compared to the text 

#it is not portable

In [44]:
frame = pd.read_csv('ex1.csv')
frame.to_pickle('frame_pickle') #changed to binary format(unreadible)
pd.read_pickle('frame_pickle') #fast loading

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

# Using HDF5

HDF5 is a well-regarded file format intended for storing large quantities of scientific array data. It is available as a C library, and it has interfaces available in many other languages, including Java, Julia, MATLAB, and Python. The “HDF” in HDF5 stands for hierarchical data format. Each HDF5 file can store multiple datasets and supporting metadata. Compared with simpler formats, HDF5 supports on-the-fly compression with a variety of compression modes, enabling data with repeated patterns to be stored more efficiently. HDF5 can be a good choice for working with very large datasets that don’t fit into memory, as you can efficiently read and write small sections of much larger arrays. While it’s possible to directly access HDF5 files using either the PyTables or h5py libraries, pandas provides a high-level interface that simplifies storing Series and DataFrame object. The HDFStore class works like a dict and handles the low-level details:

In [13]:
#while storing or loading we can give conditions 
import numpy as np
import pandas as pd
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5') # new data base created and its reference is stored in store
store['obj1'] = frame #store dataframe with the name of obj1  (hdf object)
store['obj1_col'] = frame['a'] # we can save one column as well ['a'] or whole frame as above
print(store)
x=store.obj1
print(type(x))
print(x.head())
print('--------------')
store.put('obj2', frame, format='table') # loaded in table format so when selecting we can put condition
store.select('obj2', where=['index >= 10 and index <= 15'])
store.close()
#alternate way
frame.to_hdf('mydata.h5', 'obj3', format='table')#
#frame = pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])# cannot use these both commands in one cell

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

<class 'pandas.core.frame.DataFrame'>
          a
0  2.465799
1 -0.623504
2  0.878466
3  0.017289
4  1.474359
--------------

In [8]:
store.obj1

AttributeError: 'HDFStore' object has no attribute 'obj1'

# Using microsoft excel

In [18]:
#reading
#1st way
#excel-> csv and load it to pandas
#pandas -> csv and csv->excel
#2nd way
#directly
import pandas as pd

#reading
xlsx = pd.ExcelFile('ex1.xlsx')
pd.read_excel(xlsx, 'Sheet1')
#or directly
frame = pd.read_excel('ex1.xlsx', 'Sheet1')
# writing
writer = pd.ExcelWriter('ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()
# alternative option for single sheet
frame.to_excel('ex2.xlsx')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

# Interacting with Web APIs

Many websites have public APIs providing data feeds via JSON or some other format. There are a number of ways to access these APIs from Python; one easy-to-use method that I recommend is the requests package.

In [29]:
#our data is present in website 
import requests
import numpy as np
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
#print(resp)
data = resp.json()
#print(type(data))
#print(dat
data[2]['title']

'BUG: Change IntervalDtype.kind from None to "O"'

#Each element in data is a dictionary containing all of the data found on a GitHub issue page (except for the comments). We can pass data directly to DataFrame and extract fields of interest:

In [26]:
issues = pd.DataFrame(data, 
                    columns=['number', 'title','labels', 'state'])
issues

,number,title,labels,state
0,30571,PERF: Fixed performance regression in Series init,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
1,30570,CLN: refactor tests in test_moments_ewm.py,[],open
2,30569,"BUG: Change IntervalDtype.kind from None to ""O""","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
3,30568,"BUG: IntervalDtype.kind should be ""O"" instead ...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,30567,Boolean indexing into a series with assignment,[],open
5,30566,CLN: Clean test moments for expanding,[],open
6,30565,TYP: Add return types to some top-level func,[],open
7,30564,PERF: regression in Series constructor,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
8,30563,DEPR: tz-aware array,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
9,30562,ENH: Allow absolute precision in assert_almost...,[],open
10,30561,WIP: Remove clipboard xfail,[],open
11,30560,BLD: Fix IntervalTree build warnings,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
12,30559,BUG: Rolling aggregations on grouped data igno...,[],open
13,30556,"DOC: Document behaviour of head(n), tail(n) fo...","[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
14,30555,read_csv s3 file parameter memory_map default ...,[],open
15,30554,TST: Regression testing for fixed issues,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
16,30553,TST/BUG: fix incorrectly-passing Exception in ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
17,30552,PERF: groupby with many empty groups memory bl...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
18,30550,TYP: check_untyped_defs pandas.core.computatio...,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
19,30546,DEPR: DataFrame GroupBy indexing with single i...,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
20,30544,TST: XFAIL Travis read_html tests,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
21,30543,PERF: Timestamp/Timedelta constructors when pa...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
22,30541,"TYP: Implicit generic ""Any"" for builtins","[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
23,30539,DISC: enable disallow_any_generics for mypy in...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
24,30537,Unpin ipython 7.10.1 once ipython 7.11.1 released,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
25,30533,Inconsistent index in result of groupby apply,[],open
26,30532,BUG: TypeError in groupby pct_change when fill...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,30531,Performance of maybe_box_datetimelike #30520,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
28,30526,BUG: pct_change wrong result when there are du...,[],open
29,30524,ENH: Timedelta support high-freq units,[],open

# Interacting with DataBases

In [30]:

import sqlite3

#creating table
query = """ CREATE TABLE test(a VARCHAR(20), 
        b VARCHAR(20),c REAL,
        d INTEGER);  """
# creating database file
con = sqlite3.connect('mydata.sqlite')
#running query
con.execute(query)
# table created
con.commit()
# done

In [31]:
# inserting data
#preparing data
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)
       ]
# preparing insert statement
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
# running insert statement
con.executemany(stmt, data) #replace ? with the data one by one
#finalizing data saving
con.commit()

In [32]:
#selecting/extracting data
cursor = con.execute('select * from test')
rows = cursor.fetchall()
print(type(rows), rows)

<class 'list'> [('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]

In [35]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [33]:
#print(cursor.description)
data_df = pd.DataFrame(rows, columns=[x[0] for x in cursor.description])
data_df

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [38]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
data_df =pd.read_sql('select * from test', db)
data_df

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5